class Article {
  final String title;
  final String text;

  const Article(
  {
    this.title,
    this.text,
  });
}

class Article2 {
  final String title2;
  final String text2;

  const Article2(
      {
        this.title2,
        this.text2,
      });
}

final articles = [
  new Article(
    title: 'တစ် နှင့် တ',
    text: '''
      မြန်မာစာလုံးပေါင်းသတ်ပုံကျမ်းတွင် တစ်နှင့်တကို ခွဲခြား
ရေးသားရန် သတ်မှတ်ပြဋ္ဌာန်း ထားသည် တစ်နှင့်တကို ခွဲခြား
ရေးသားရန်အတွက် နည်းလမ်း (၃)ရပ်ကို ချမှတ်ထားသည်။

(က) နာမ်၊ မျိုးပြပစ္စည်းတို့နှင့် ယှဉ်တွဲသော တသည်
 ကိန်းဂဏန်းတစ်ကို အရင်းခံသော ပုဒ်ဖြစ်သဖြင့် စသတ်ဖြင့် 
 ရေးရန်
သာဓက။       ။တစ်ခု၊ တစ်ဆင့်၊ တစ်ယောက် ..... စသည်။

(ခ) ဤသို့သော ပုဒ်များတွင် အခြားပုဒ်ထပ်ဆင့် ယှဉ်တွဲ
လာသည့်တိုင်အောင် သင်္ချာ ကိန်းဂဏန်းတစ်သည် 
သင်္ချာသဘောမှ ရွေ့လျားခြင်းမရှိသောကြောင့် စသတ်ဖြင့် 
ပင်ရေးရန်၊
သာဓက။    ။တစ်ခုခု၊  တစ်ဆင့်ခံ၊ တစ်ထောက်တစ်နား၊ 
တစ်ယောက် တစ်လှည့် .... စသည်။

(ဂ) ကြိယာ၊ နာမဝိသေသန။ မြည်သံစွဲ ပုဒ်များနှင့်ယှဉ်သော 
အာရုပစ္စည်း တကိုမူ စ မသတ်ဘဲ ရေးရန်။
သာဓက။    ။ တကျက်ကျက်၊ တခမ်းတနား၊ တစောင်း၊ တဖြူးဖြူး၊ 
တရိပ်ရိပ်၊တလွဲ၊ တအံ့တသြ၊ မခို့တရို့၊ မဟုတ်တရုတ်၊ အတတ၊ 
အမှတ်တရ၊ အရောတဝင် .... စသည်။

      ဤနည်းလမ်း သုံးရပ်ကို မှတ်သားပြီး တစ်နှင့် တကို မှန်ကန်စွာ 
ရေးသားနိုင်စေရန် လေ့လာ ကြည့်ရမည်ဖြစ်သည်။
''',
  ),
  new Article(
    title: 'ပဲ နှင့် ဘဲ',
    text: '''
    ပဲနှင့် ဘဲကို ကွဲကွဲ ပြားပြား ခွဲခြားသတ်မှတ် ရေးတတ်
ကြဖို့လိုသည်။ ပဲကား အနက်စွဲအရေး၊ ဘဲ ကား ဖဲ၏ အသံစွဲအရေး
ဖြစ်သည်။ ပဲနှင့် ဘဲ (ဖဲ)တို့ အနက်လည်းမတူ၊ အရေးလည်းအတူ။ 
ထိုကြောင့် အသုံးအနှုန်းရေးထုံး မတူနိုင်ပေ။ ပဲကို ပက်ဟု
လည်းရေးက သုံးစွဲရိုးရှိသည်။ ပင်နှင့်လည်း အနက်တူပင် ဖြစ်သည်။
 ပဲ၊ ပက်၊ ပင် အနက်တူဖြစ်သည်။ သို့ဖြစ်ရာ ပဲကို အောက်ပါအတိုင်း 
 သုံးကြရသည်။
 
၁။ လူပဲ၊ နတ်ပဲ၊ ဗြဟ္မာပဲ၊ သူပဲ၊ ငါပဲ၊ ဆရာပဲ၊ ကျော်ကသားပဲ၊ 
စာအုပ်ပဲ၊ အိမ်ပဲ၊ ကျောင်းပဲ၊ မြစ်ပဲ၊ ချောင်းပဲ စသည် .....
	
      ဤတွင် ပဲ ကို ပင်နှင့် ဖလှယ်လျှင် လူပင်၊ နတ်ပင်၊ ဗြဟ္မပင်၊ 
သူပင်၊ ငါပင်. . . . စသည်အတိုင်း ဖြစ်လာမည်။ ပဲ၊ ပင်၏ အနက်မှာ 
ပေါင်းစည်းအနက်ဖြစ်သည်။ စင်စစ်ဟု အနက်ဖွင့်လျှင်ရနိုင်သည်။
သာဓက။	။ လူပဲ၊နတ်ပဲ၊ ဗြဟ္မာပဲ

		လူပင်၊ နတ်ပင်၊ ဗြဟ္မာပင်
		လူစစ်စစ်၊ နတ်စစ်စစ်၊ ဗြဟ္မာစစ်စစ်။
		
၂။ စားပဲစားနိုင်လွန်း၊ တတ်ပဲတတ်နိုင်လွန်း၊ ပြောပဲပြောနိုင်
လွန်း၊ သောက်ပဲ သောက်နိုင် လွန်း စသည်.....
ဤ၌လည်း ပဲကိုပင်၊ ပင်လျှင် တို့နှင့် ဖလှယ်နိုင်သည်။
ဥပဒေသ။ 	။ပင်၊ ပင်လျှင် တို့နှင့်ဖလှယ်နိုင်ပြီး စင်စစ်ဟုအနက်ပေး၌ 
ရလျှင် ပဲကို သုံးရန်။ ဘဲ ကား ဖဲကြဉ်ခြင်းအနက်၊ ဖဲခွာခြင်း 
အနက်ရှိသည်။ရှောင်ကြဉ်ခြင်း၊ တားမြစ်ခြင်း၊ ငြင်းပယ်ခြင်း 
အနက်ရှိသည်။ သို့ဖြစ်ရာ ဘဲ ကို တားမြစ်ခြင်း၊ ငြင်းပယ်ခြင်း
အနက်ရှိသည့် မနှင့် တွဲ၍ သုံးကြရသည်။

မသိဘဲ၊ မစားဘဲ၊ မသွားဘဲ၊ မလာဘဲ၊ မကျက်ဘဲ၊ မဖတ်ဘဲ စသည်.....

      ဆိုလိုသည်မှာ မနှင့် ဘဲ အကြားတွင် ကြိယာကိုထား၍ 
သုံးခြင်းမျိုးဖြစ်သည်။

      အနက်အဓိပ္ပာယ် အားဖြင့်  ဤသို့ မျတ်ယူနိုင်သည်။
      
  မသိဘဲ မသိမူ၍၊ သိခြင်းကို ဖဲကြဉ်၍
  မစားဘဲ မစားမ၍ စားခြင်းကို ဖဲကြဉ်၍
  မဖတ်ဘဲ မဖတ်မူ၍၊ ဖတ်ခြင်းကို ဖဲကြဉ်၍

  ဥပဒေသ။ 	။မ နှင့်တွဲ၍ ဖဲကြဉ်သောအနက်ကို သုံးလိုသော် 
  ဘဲကို သုံးရန် (မ....ဘဲ) 
    ''',
  ),
  new Article(
    title: 'ဖက်နှင့် ဘက်',
    text: '''
      အနက်သဘောအားဖြင့် ဖက် မှာသာ အနက်ရှိပေသည်။ 
ဘက်မှာ အနက်မရှိပါ။ သို့ရာတွင် အရာဌာနတိုင်း အနက်စွဲရေး
ပြီး၊ ရေးသည့်အတိုင်းအသံ ထွက်ရိုးမရှိပါ။ ရေးတော့ အမှန် 
ဖတ်တော့အသံဟု ပြောစမှတ်ပြုကြသည်။

      ဤသည်ကို လိုက်၍ အသံအတိုင် ရေးကြရသည်လည်းရှိသည်။ 
အသံစွဲအရေးဟု ဆိုသည်။ ဖက်နှင့် ဘက်လည်း ဤအတိုင်းပင်ဖြစ်
သည်။ ဖက် ကား အနက်စွဲ အရေးဘက် ကား အသံစွဲအရေးဖြစ်
သည်။ ဖက်ကို အောက်ပါတို့တွင် သုံးသည်။

၁။  ကြိယာ ဖက်
    
   သာဓက။  ။စုံဖက်၊ စွက်ဖက်၊ ဖက်စပ်၊ ဖက်တွဲ၊ လိုက်ဖက်၊ 
            ယှဉ်ဖက်၊ ဆွဲဖက်၊ တွဲဖက် စသည်တို့ကဲ့သို့
            သော ကြိယာများ။
               
၂။  အဖော်အဖက်

  သာဓက။   ။ကူဖော်လောင်ဖက်၊ ကြင်ဖော်ကြင်ဖက်၊ ဆေးဖော်
            ကြောဖက်၊ ဆေးဖော် ဝါးဖက်၊ လုပ်ဖော်ကိုင်ဖက်၊ 
            သွားဖော်သွားဖက် စသည်တို့ကဲ့သို့သော 
            ဖော်-ဖက် တွဲလုံးများ
  
၃။  သင်္ချာနှင့် တွဲသော ဖက်

  သာဓက။   ။တစ်ဖက်တစ်ချေက်၊ နှစ်ဦးနှစ်ဖက်။ သုံးဖက်ခြင်း၊
            လေးဖက်နာ၊ အနား ငါးဖက် ပဉ္စဂံ၊ လေးလုံးမြောက်
            ဖက် စသည်ဖြင့် ဖြစ်သည်။
            
      ဘက်ကို အောက်ပါတို့တွင် သုံးသည်-
      
၁။  အရပ်မျက်နှာနှင့်တွဲလျှင် -ဘက်

  သာဓက။   ။အိမ်ဘက်မှာ၊ ဈေးဘက်မှာ၊ မြစ်ဘက်မှာ၊ ရွာဘက်
            မှာ၊ တောဘက်မှာ၊ ဝဲဘက်၊ ယာဘက်။
            
၃။  သူ၊ ငါ၊ ကျား၊ မ စသည်တို့နှင့် တွဲလျှင် -ဘက်

	သာဓက။   ။သူ့ဘက်၊ ငါ့ဘက်။ ကိုယ့်ဘက်၊ ယောက်ျားဘက်၊ 
	          မိန်းမဘက်၊ လင်ဘက်၊ မယားဘက်၊ အဖေ့ဘက်၊ အမေ့ဘက်၊ 
	          ဆရာ့ဘက်၊ တပည့်ဘက်။
	          
၄။  အာဒိစကားလုံး (အစစကားလုံး) ဖြစ်လျှင် -ဘက်

	သာဓက။   ။ဘက်ကန်၊ ဘက်စုံ၊ ဘက်ပေါင်းစုံ၊ ဘက်လိုက်၊ 
	          ဘက်မလိုက်။
	          
      ဤတွင်ခြွင်းချက်တစ်ခု ရှိသည်။ အဖော်အဖက် မှန်သမျှကို
ဖော်ဖက် ဟု ဖဦးထုပ်နှင့်ရေးသော်လည်း ရဲဘော်ရဲဘက်၊
ရဲဘော်၊ ရဲဘက်တို့ ကိုမှု ဘကုန်းနှင့် ပင် ရေးရန်ဖြစ်သည်။ 
အရေးတွင် ကျယ်မှုအရ ခြွင်းချက်ဟု မှတ်နိုင်သည်။
    ''',
  ),

  new Article(
    title: 'ကာ နှင့် ခါ',
    text: '''
      ကာ နှင့် ခါသည် အရေးမတူသော်လည်း အသံထွက် တူတတ်သော
ကြောင့် ရေးရာ၌ ရောထွေးတတ်သည်။

      တစ်ပြိုင်နက်ဖြစ်စေ၊ ဆက်တိုက်ဖြစ်စေ ဖြစ်ပျက်ကြောင်းကို
ပြလိုသော် ကာ ကို သုံးသည်။

	  အိပ်ကာ စား ကာ နေသည်။
	  ရယ်ကာမောကာပြောသည်။
	  ဆေးလိပ်ကိုက် ကာ စာဖတ်သည်။

      အချိန်၊ အခါ၊ ကာလတို့ကို ပြလိုသော် ခါ ကို သုံးသည်။
      
	  ငယ်စဉ်အခါ ပညာမရှာလျှင် ကြီးခါမှ နောင်တရမည်။
	  ပန်းများကို ဆုပ်ကာ၊ ကြဲပြီးသောအခါလျှင်......
	  ဘဝ မွန်းတိမ်းချိန်ရောက်ခါမှ........
	  လက်ဖျားကိုင်းကာ၊ လှူသောအခါလည်း၊ မျက်ပါမရှိ.......
	  အလွမ်းထပ်ကာ၊ ခုချိန်ခါကို လေပါမိုးနှင့်..........
	  ရွှေချဉ်ပေါက်တုံးခါမှ မောင်ဖုန်းပြန်ခဲ့မယ်။
	  ရောက်ခါနီး
    ဖြစ်ခါနီး
''',
  ),

  new Article(
    title: 'ဖူး နှင့် ဘူး',
    text: '''
      မြန်မာစာအဖွဲ့က ထုတ်ဝေသော မြန်မာစာအဘိဓာန်တွင် ဖူး 
ကို ဖူးတွေ့၊ ဖူးမြော်၊ ဖူးရောင်၊ ဖူးထွက် ဖူးဟူသော အနက်များ
ကို ပြပြီးနောက် “ဖူး၊ စည်း- ကြုံတွေ့ သိမြင် ဖြစ်ပျက်
ခဲ့ပြီးကြောင်း ထင်ရှားစသည့် စကားလုံး” ဟု ဖွင့်ဆိုထားသည်။ 
စည်းမှာ ပစ္စသည်း ဟုဆိုလိုသည်။
	
	    ဘူးကို ဘူးသီး၊ ထည့်စရာဘူး ဟူသောအနက်များကို 
ပြပြီးနောက် “ဘူး၊ စည်း-ငြင်းပယ်သော အနက်ဖြင့် ကြိယာကို 
ထောက်ကူသော စကားလုံး” ဟု ဖွင့်ဆိုထားသည်။

	    ဤတွင် အခြား ဖူး၊ အနက်၊ ဘူးအနက်များအကြောင်း ရှင်းပြ
လိုရင်း အဟုတ်ပါ။ ပစ္စည်းစကားလုံးဖြစ်သော ဖူးနှင့် ပစ္စည်း 
စကားလုံးပင်ဖြစ်သော ဘူးတို့ အသုံးတူကြောင်း ခွဲခြား
မှတ်သားရန် အကြောင်းကို ရှင်းပြလိုရင်းဖြစ်သည်။

  သာဓက။ ။စားဖူးသည် ဆိုသည်မှာ စားသည့် အလုပ်နှင့် 
            စားခြင်းနှင့် ပူးယှဉ်၊ ထိတွေ့၊ ကြုံကြိုက်၊ 
            ပေါင်းစည်း ခဲ့သည်မှာ အမှန်ဖြစ်ကြောင်း၊ 
            စားခဲ့သည်မှာ ထင်ရှားကြောင် ဆိုလိုခြင်းဖြစ်သည်။
	
	    မြင်ဖူးသည် ဆိုသည်မှာ မြင်သည့်အဖြစ်နှင့် မြင်ခြင်းနှင့်
ပူးယှဉ်၊ ထိတွေ့၊ ကြုံကြိုက်၊ ပေါင်းစည်း ခဲ့သည်မှာ အမှန်ဖြစ်
ကြောင်း၊ မြင်ခဲ့သည်မှာ ထင်ရှားကြောင်း ဆိုလိုခြင်းဖြစ်သည်။

      ဘူး၏ မူလအနက်ကို ရှာလိုလျှင်လည်း ဖူး၏ မူအအနက်မှာပင် 
ရှာရမည် ဖြစ်ပါသည်။ ဖူးမှာ အနက်စွဲရေး၊ မူလအနက်ရှိသည်။ 
ဘူးမှာ အသံစွဲအရေး၊ မူလ အနက်မရှိပေ။ 

      ပစ္စည်း စကားလုံးဖြစ်သော  ဘူး၏ မူလအနက်မှာ လည်း 
ဖူး၏ အနက်ပင် ဖြစ်သည်။ ဖူး၏ အနက် ပူးယှဉ်၊ ထိတွေ့၊ ကြုံကြိုက်၊ 
ပေါင်းစည်း အနက်များပင် ဖြစ်သည်။ ထိုမူလအနက်မှ ဆင့်ပွား
လာကာအမှန်တကယ်ဖြစ်သည်။ ထင်ရှားသည် ဟူသော အနက်ကို 
ဆောင်လျက်ပစ္စည်းစကားလုံးအဖြစ် တာဝန်ယူရသည်။ 
ဖူးလည်း သေချာသည့် အနက်၊ အမှန်တကယ် ဖြစ်သည့်အနက်၊ 
ထင်ရှားသည့် အနက်ဖြင့်ပင် ကြိယာကိုအထောက်အကူပြုသည်။ 
ဘူး လည်း သေချာသည့်အနက်၊ အမှန်တကယ် ဖြစ်သည့်အနက်၊ 
ထင်ရှားသည့် အနက်ဖြင့်ပင် ကြိယာကိုအထောက်အကူ ပြုသည်။

    	သို့ရာတွင် ဖူး ကား အဖြစ် သေချာခြင်းကို ပြသည်။ ဘူး 
ကား ငြင်းပယ်ခြင်း အနက်ရှိသည့် မနှင့် ယှဉ်၍ မဖြစ်ကြောင်း 
သေချာခြင်းကို ပြသည်။ ဖူး ကားအဖြစ် မှန်ကန်ထင်ရှားခြင်းကို 
ပြသည်။ ထို့ကြောင့်လည်း ဘူးကို ငြင်းပယ်သော အနက် အမှန်ထင်
ရှားသေချာခြင်းကို ပြလိုသည့်အခါ သုံးခြင်း ဖြစ်သည်။

  သာဓက။   ။မမြင်ဘူး ဆိုသည်မှာ မမြင်သည်မှာ မှန်ကန်ထင်ရှား
            သေချာခြင်း၊ မြင်မှုကို ငြင်းပယ်ခြင်း အနက်ရှိသည်။ 
            အစားဘူးဆိုသည်မှာ မစားသည်မှာ မှန်ကန်ထင်ရှား 
            သေချာခြင်း၊ စားမှုကို ငြင်းပယ်ခြင်း အနက်ရှိသည်။
            
      မပြောဘူး ဆိုသည်မှာ မပြောသည်မှာ မှန်ကန်ထင်ရှား 
သေချာခြင်း၊ ပြောမှုကို ငြင်းပယ်ခြင်း အနက် ရှိသည်။ မမြင်၊ 
မစား၊မ ပြောဟု “ဘူး” မပါဘဲ သုံးလျှင်လည်း ရသည်ပင်ဖြစ်သည်။ 

      သို့ရာတွင် မမြင်ဘူး၊ မစားဘူး၊ မပြောဘူးဟု ဆိုသဖြင့် 
မမြင်၊ မစား၊ မပြောသည်မှာ မှန်ကန်ထင်ရှား သေချာကြောင်း 
ပို၍ လေးနက်လာသည်။ ထို့ကြောင့် ငြင်းပယ်အနက် ဖြစ်သော 
မ နှင့် တွဲ၍ သုံးရသည်။ (မ .... ဘူး)

      အချုပ်အားဖြင့် ဆိုသော ကြုံတွေ့သိမြင် ဖြစ်ပျက်ခဲ့ပြီး 
ထင်ရှားစေလိုက ဖူး ကို သုံးရန်၊ ငြင်းပယ်သော အနက်ဖြင့်  
ကြိယာအထောက်အကူ ဖြစ်စေလိုသော ငြင်းပယ်ခြင်း အနက်ရှိသည့် 
မ နှင့် ယှဉ်၍ ဘူး ကို သုံးရန် ဖြစ်ပါသည်။
    
    မမြင်ဖူးဘူး။
    အစားဖူးဘူး။
    မပြောဖူးဘူး။

    စသည်တို့တွင် ဖူးနှင့် ဘူး ခွဲထားအသုံးကို လေ့လမှတ်သား
နိုင်ပါသည်။
    ''',
  ),

  new Article(
    title: 'မီ နှင့် မှီ',
    text: '''
      ဟထိုးမဲ့ မီနှင့် ဟထိုးရှိ မှီကို မှားရေးတတ်ကြသည်။ 
မှားရေးတတ်ကြသည့် အကြောင်းအရင်းမှာ စကားပြောရာတွင်
ဖြစ်စေ မီနှင့်  မှီ အသံတူနေသောကြောင့် ဖြစ်သည်။ မီဟု 
ရေးသော်လည်း မှီဟု ထင်မှတ်မှားယွင်း ရေးသားဖြစ်ကြခြင်း
ဖြစ်သည်။ အမှန်စင်စစ် မီနှင့် မှီ မရောထွေးသင့်။

      မီကား မီ နှင့် အနက်ရင်းတူပါသည်။ ထိမိ၊ ဆက်စပ်၊ ပူးတွဲ၊ 
ပေါင်းယှဉ်၊ ညီမျှသည့် အနက်ဖြစ်ပါသည်။

      ရှေ့မှ ပြေးသူကို လိုက်၍ မီ သည်ဟု ဆိုရာတွင် လိုက်၍ 
မိသည်ဟုသော အနက်ဖြစ် သဖြင့် မိ သည်ဟုသာ ဟထိုးမဲ့ရေး
ရသည်။

      အမြင့်တွင်၊ ဘေးတွင်၊ အနိမ့်တွင် ရှိနေသည့် အရာဝတ္ထု 
တစ်စုံတစ်ခုကို လက်လှမ်းမီ သည်ဟု ဆိုလျှင်လည်း လှမ်း၍ 
မိ သည်ဟူသော အနက်ပင် ဖြစ်သဖြင့် ဟထိုးမဲ့ မီနှင့် ပင်ရေး
ရသည်။
  
      အချိန်မီသည်တွင် မီ၏ အနက်မှာ ထိမိ၊ ဆက်စပ်၊ ပူးတွဲ၊ 
ပေါင်းယှဉ်၊ ညီမျှ အနက်ပင် ဖြစ်သည်။ သတ်မှတ်သော အချိန်
နှင့် ထိမိဆက်စပ် ပေါင်းယှဉ်ညီမျှသည်ဟု ဆိုလိုသည် 
မလျော့မပိုဖြစ်သည်ဟု ဆိုလိုသည်။ ထို့အတူပင် ရထားမီးသည်၊ 
ရထားချိန်မီသည်၊ ကျောင်းမီသည်၊ ကျောင်းချိန်မီသည် စသည်
တို့၌လည်း နည်းတူဖြစ်သည်။

      စံချိန်မီသည်၊ စံမီသည် ဆိုသည်မှာ စံနှင့် မလျော့မပို
ဖြစ်သည်။ စံနှင့် ကိုက်ညီသည်ပင်  ဖြစ်သည်။ ခေတ်မီသည် 
ဆိုသည်မှာ ခေတ်နှင့် ကိုက်ညီသည်၊ ခေတ်နှင့် လိုက်လျော
ညီထွေ ရှိသည်ဟု ဆိုလိုသည်။ ၁၅-ရက်နေ့အမီ ဆိုရာ၌လည်း 
၁၅-ရက်နေ့ကို မကျော်လွန် မပိုစေဘဲ၊၁၅-ရက်နေ့နှင့် ကိုက်
ညီစွာဟု ပင် ဆိုလိုပေသည်။

      ထို့ကြောင့်လည်း မြန်မာစာအဖွဲ့က ပြုစုထုတ်ဝေသော 
မြန်မာအဘိဓာန်တွင် မီကို “မီ၊ ကြိ-လှမ်း၍ ရောက်နိုင်၊ 
ထိနိုင်သည်။ တိုင်ရောက်သည်” ဟု အနက်ဖွင့် ဆိုထားခြင်း 
ဖြစ်သည်။ အချုပ်ဆိုသော် မိသည့်အနက်၊ တူညီ၊ ကိုက်ညီ၊ 
ညီမျှသည့်အနက်ကို ဆိုလိုပါက ဟထိုးမဲ့ မီကို အသုံးပြုရန် 
ဖြစ်ပါသည်။

      ခေတ်မီသည်၊ စံမီသည်၊ ရထားမီသည်၊ လိုက်မီသည်၊ 
လှမ်းမီသည်၊ အချိန်မီသည် စသည်တို့ ကဲ့သို့သော် ကြိယာ
ဖြစ်သော မီ အကြောင်းကို ရှင်းလင်းပြီးနောက် ပစ္စသည်း 
စကားလုံးဖြစ်သော မီအကြောင်းကို ရှင်းလင်း ရန်ရှိပေသည်။

      ယင်းမီ ကို မနှင့်တွဲ၍ သုံးလေ့ရှိသည်။ မကြာမီ၊ မစားမီ၊ 
မပြောမီ၊ မလာမီ၊ မသွားမီ စသည်ဖြင့် သုံးသည်။ ခင် ဟူသော 
စကားနှင့် ဖလှယ်၍ သုံးနိုင်သည်။

      မကြာခင်၊ မစားခင်း၊ မပြောခင်၊ မလာခင် ဟူ၍ ဖြစ်သည်။ 
ကြိယာ မီ ၏ အနက်ဖြစ်သည့် ထိမိ၊ တိုင်ရောက်သည့် အနက်ပင် 
ဖြစ်သည်။ မကြာမီ ဆိုသည်မှာ ကြာသည့် ကာလသို့ မတိုင် 
ရောက်သေးဘဲ ဟူသော အနက်ဖြစ်သည်။ မပြောမီ၊ မလာမီ၊ 
မသွားမီ၊ စသည်တို့တွင်လည်းပြောခြင်း၊ လာခြင်း၊ သွားခြင်း
သို့ မတိုင်ရောက်သေးဘဲ ဟူသော အနက်ပင် ဖြစ်သည်။

      ထို့ကြောင့်လည်း မြန်မာအဘိဓာန်တွင် “မှီ၊ ကြိ-၁၊ 
တစ်စုံတစ်ရာကို ယှဉ်ကပ် အားပြုသည်။ ၂၊ အားကိုးအားထား
ပြုသည်”ဟု အနက်ဖွင့်ဆိုထားပေသည်။ ပထိုးရှိ မှီကို 
“မှီခိုသည်၊ မှီငြမ်းပြုသည်၊ မှီတင်းသည်၊ မှီဝဲသည်၊ မှီအုံး” 
စသည်ဖြင့် သုံးစွဲလေ့ရှိသည်။
    ''',
  ),
  /*new Article(
    title: '',
    text: '''
    
    ''',
  ),*/
];

final articles2 = [
  new Article2(
    title2: 'ဝိုက်ချ နှင့် မောက်ချ',
    text2: '''
      ဝိုက်ချသည်အက္ခရာတစ်ခုခုနောက်တွင် ဝိုက်ဝိုက်ကွေး
ကွေး ရေးချသော အာသရ လက္ခဏ (ာ) ဖြစ်သည်။

      မောက်ချသည် အက္ခရာတစ်ခုခုနောက်တွင် မိုမိုမောက်
မောက် ရေးချသော အာသရ လက္ခဏာ (ါ) ဖြစ်သည်။

      ဝိုက်ချ (ာ)  ကို ခ၊ ဂ၊ င၊ ဒ၊ပ၊ ဝ အက္ခရာတို့နှင့် 
တွဲမသုံးရ။ သုံးသော် ဆ၊ က၊ က၊ အ၊ ဟ၊ တနှင့် လွဲမှားတတ်သည်။ 
ထိုအက္ခရာ ခြောက်လုံးပင် ဖြစ်သော်လည်း ပင့်၊ ရစ်၊ ဆွဲ၊ 
ထိုး၊ (ျ၊ ြ၊ ွ ၊ ှ) နှင့် ယှဉ်လျှင်မူ ဝိုက်ချနှင့် တွဲသုံး
နိုင်သည်။ (ခွာ၊ ဂျာ၊ ငြာ၊ ပျာ၊ ပြာ၊ပွာ၊ ဝှာ) မောက်ချ (ါ) 
ကို ခ၊ ဂ၊ င၊ ဒ၊ ပ၊ ဝ အက္ခရာခြောက်လုံးနှင့်သာ ယှဉ်တွဲ
သုံးသည်။ ထို့ကြောင့်

      ခင်ဂူငေါဒေါပုံဝ၊ ဝိုက်ချမသုံးရ၊
      မောက်ချအသုံးကျ။
    ''',
  ),

  new Article2(
    title2: 'ဂ ငယ် နှင့် ၈',
    text2: '''
      ဗျည်းအက္ခရာ ဂ နှင့် ကိန်းဂဏန်းသင်္ကေတ ဂ တို့တွင် 
ပုံသ ချင်းတူသည်။ ကွဲပြားချက် တစ်ခုသာ ရှိသည်။

    အက္ခရာ ဂ ငယ်တွင် အဆန်မပါ။
    ဂဏန်းဂတွင် အဆန်ပါသည်။
    ထို့ကြောင့် 
    အဆန်မပါ၊ဂငယ်ပါ၊
    ပါလျှင်ဂဏန်းရှစ်
    ရကောက်နှင့် ခုနှစ်

      မြန်မာဗျည်း သုံးဆယ့်သုံးလုံးတွင် နှစ်ဆယ့်ခုနှစ်
လုံးမြောက်ဗျည်းကို ရကောက် ဟု ခေါ်သည်။ ရဟု ရေးရသည်။ 
ဦးခေါင်းတွင် အဆန်ပါသည်။ 

      ကိန်းဂဏန်းခုနှစ်ကို ရေးသော် ၇ဟု ရေးရသည်။ အဆန်
မထည့်ရ။ အဆန်ထည့်လျှင် ရကောက်နှင့် မှားတတ်သည်။

    ထို့ကြောင့် 
    ရကောက်မှန်ခဲ့၊ အဆန်ထည့်။
    အဆန်မဲ့လျှင် ခုနစ်ပင်။
    ''',
  ),

  new Article2(
    title2: 'ဌ နှင့် ဋ္ဌ',
    text2: '''
      ဌသည် ဌ ဝမ်းဘဲ အက္ခရာတစ်လုံတည်း ဖြစ်သည်။ 
  
      ဋ္ဌသည် ဋနှင့် ထပ်ဆင့်ထားသော ဗျည်းတွဲဖြစ်သည်။
      
      ဌာန၊ ဌာန်၊ ဌာပနာ၊ ပါဌ်ဆင့် သူဌေး စသည်တို့ကို ရေးသော
အခါ လည်ရစ်မပါသော ဌ သက်သက်နှင့်ရေးရသည်။

      ဥက္ကဋ္ဌ၊ အဋ္ဌမ၊ သေဋ္ဌေး၊ ကမ္မဋ္ဌာန်း စသည်တို့ကို 
ရေးလျှင် ဋနှင့် ဌ ဆင့်ထားသော လည်ရစ်ပါသည့် ဋ္ဌ နှင့်
ရေးရသည်။
    ''',
  ),

  new Article2(
    title2: 'ဉ ကလေးနှင့် ည ကြီး',
    text2: '''
      ဉ (ဉ ကလေး) ကို ဥဦးခေါင်းမဲ့ဟုလည်း ခေါ်သည်။ 
ရေးသောအခါ ခြေထောက်ကို အရည်ဆွဲရသည်။ (ဉ)

      သရအက္ခရာ ဥ နှင့် ကွဲပြားချက်မှာ သရ အက္ခရာ ဥ က 
ခြေထောက်တို၍ ဉ ကလေးက ခြေထောက် ရှည်သည်။

      ည ကြီး ဉ ကလေးနှစ်လုံး ဆင့်ထားသော ဗျည်းတွဲဖြစ်သည်။ 
ထို့ကြောင့် ည ရှေ့က ရှိသော အသံကို အင်၊ အိန်၊ အုန် အသံ
တစ်ခုခု ဖြင့် ရွတ်ရ ခြင်းဖြစ်သည်။ ထို့ကြောင့်

    သညာ ကို သင်ညာ
    သာမည ကို သာမျင်ညာ့
    ဝိညာဉ် ကို ဝိန်ညင်
    သုည ကို သုန်ညာ့ ဟု အသံထွက်သည်။

  မှတ်ချက်။   ။စဉ်၊ ချဉ်၊ ပျဉ်၊ ယှဉ် စသည်ကဲ့သို့ အသတ်နှင့် 
                ယှဉ်လာလျှင် မှားနိုင်ဖွယ်   မရှိသောကြောင့် 
                ဥ ကလေးကို ခြေထောက်မရှည်ဘဲ ရေးသည်။
    ''',
  ),
];