import 'package:flutter/material.dart';
import 'package:myanmar_sar/text_style.dart';
import 'package:myanmar_sar/make.dart';

class GrammarChapter0Page extends StatefulWidget {
  @override
  _GrammarChapter0PageState createState() => _GrammarChapter0PageState();
}

class _GrammarChapter0PageState extends State<GrammarChapter0Page> {

  Widget _makeTab(i, imageName){
    var name;
    var text;
    switch (i) {
      case '0':
        name = 'မူရင်းအရေးအသားများ';
        text =  '''မြန်မာအက္ခရာအရေးအသားကို မြန်မာသက္ကရာဇ် ၄၀ဝ ကျော် (အေဒီ -၁၁ ရာစု) မှစ၍ တွေ့ရှိခဲ့ရသည်။ ထိုအချိန်မှစ၍ ယနေ့အထိ ခေတ် အဆက်ဆက် အသုံးပြုခဲ့သော မြန်မာအက္ခရာတို့သည် နှစ်ကာလကြာလာသည်နှင့်အမျှ ပုံသဏ္ဌာန်အဆင့်ဆင့် ပြောင်းလဲခဲ့သည်။ ထိုသို့ပြောင်းလဲခဲ့ပုံကို မူရင်းအရေးအသားများကို လေ့လာခြင်းဖြင့် သိနိုင်သည်။ မူရင်းအရေးအသားဆိုသည်မှာ မူလရေးသားခဲ့သည့် အချိန်မှစ၍ ယနေ့တိုင် မူလအတိုင်း တည်ရှိ နေသော စာများကို ဆိုလိုသည်။ တစ်နည်းအား ဖြင့် တစ်ဆင့်ကူးရေးထားခြင်းမဟုတ်သည့် စာများကို ဆိုလိုသည်။ ရှေ့ခေတ်မူရင်း အရေးအသားများကို ရှေးဟောင်းအုတ်ခွက်စာ၊ စဉ့်ကွင်းစာ ကျောက်စာ၊ မင်စာ၊ ပေစာ၊ ပုရပိုက်စာ၊ ခေါင်းလောင်းစာ စသည်တို့၌ တွေ့နိုင်သည်။
''';
        break;
      case '1':
        name = 'အုတ်ခွက်စာ';
        text =  '''ပုဂံခေတ် ရှေ့မြန်မာတို့သည် ရွှံ့စေးပြားပေါ်တွင် ဗုဒ္ဓ ရုပ်ပွားတော်များ ပုံနှိပ်၍ မီးဖုတ်ပြီး အုတ်ခွက်ဘုရားများ ပြုလုပ်မူဇော်ခဲ့ကြသည်။ အုတ်ခွက်ဘုရားများ၏ အောက်ခြေနှင့် ကျောဘက်တွင် ကုသိုလ်ရှင်၏ ဆုတောင်းစားများ ပါတတ်သည်။ ယင်းစာများသည် အလွန်ခိုင်လုံသော မူရင်းအရေးအသားများ ဖြစ်ပေသည်။ ပုဂံခေတ်အနော်ရထာမင်း စောလူးမင်းနှင့် ကျန်စစ်သားမင်းတို့လက်ထက်တွင် အုတ်ခွက် ပြုလုပ်ခြင်း ခေတ်စားခဲ့သည်။ အုတ်ခွက်ပြုလုပ် ပူဇော်သူများတွင် အဆိုပါမင်းတို့ကိုယ်တိုင် ပါဝင်ခဲ့ကြသည်။
''';
        break;
      case '2':
        name = 'စဉ့်ကွင်းစာ';
        text =  '''ပုဂံခေတ်က ပုဂံခတ်က ဘုရားတည်သော ကုသိုလ်ရှင်အချို့သည် မိမိတို့၏ ကောင်းမှုစေတီပုထိုးများကို ၅၅၀-ဇာတ်နိပါတ် သရုပ်ဖော်ရုပ်လုံး၊ ရုပ်ကြွ အုတ်ချပ်များဖြင့် ပတ်ပတ်လည် စီခြယ်ပူဇော်ခဲ့ကြသည်။ အကွက်တစ်ကွက်တွင် ဇာတ် တစ်ဇာတ်ကျသော် လည်းကောင်း၊ ဇာတ်တစ်ဇာတ်ကို အကွက်များစွာဖြင့် သော်လည်း ကောင်း ရုပ်ကြွပြုလုပ်ပြီး သက်ဆိုင်ရာ ဇာတ်နိပါတ်၏အမည်နှင့် အမှတ်စဉ်၊ ဇာတ်အညွှန်း များကို ကမ္ပည်းအက္ခရာ ရေးထိုးထားသည်။ ဤရုပ်ကြွများကို စဉ့်ကွင်းဟုခေါ်သည်။ စဉ့်ကွင်း၌ ရေးထားသည့်စာကို စဉ့်ကွင်းစာဟု ခေါ်သည်။ စဉ့်ကွင်းများကို အနော်ရထာမင်း (အေဒီ ၁၀၄၄-၁၀၇၇) မှစ၍ ပုဂံမင်းများ ပြုလုပ်ပူဇော်ခဲ့ကြသည်။ စေတီပုထိုး၏ ကုသိုလ်ရှင်နှင့် သမိုင်းကိုသိလျှင် ထိုစေတီ၌ရှိသည့် စဉ့်ကွင်းစာများ၏ ခုနှစ်သက္ကရာဇ်ကို တွက်ဆနိုင်သည်။''';
        break;
      case '3':
        name = 'ကျောက်စာ';
        text =  '''သက္ကရာဇ်အခိုင်အမာပါရှိသော တွေ့ရှိသမျှ မြန်မာကျောက်စာ တို့တွင် မြန်မာသက္ကရာဇ် ၄၇၅-ခုခန့် (အေဒီ ၁၁၁၃-ခန့်) ရေးထိုးခဲ့သည့် ရာဇကုမာရ် ကျေက်စာသည် အစောဆုံးပင်ဖြစ်သည်။ ထို့နောက်တွင်မူ ပုဂံခေတ်တစ်ခေတ်လုံးသာမက ပင်းယ၊ အင်းဝ၊ အောင်ငူ၊ ညောင်ရမ်း၊ ကုန်းဘောင်ခေတ်ထိအောင် ကျောင်းကန် ဘုရား ဒါယကာ ကုသိုလ်ရှင်အချို့သည် မိမိတို့ကောင်းမှု ကုသိုလ်နှင့် စပ်လျဉ်း၍ မော်ကွန်း ကျောက်စာများ ရေးထိုးထားခဲ့ကြသည်။ ခေတ်အဆက်ဆက် ရေးထိုးထားခဲ့သည့် ကျောက်ထွင်းအက္ခရာများကို နှိုင်းယှဉ်လေ့လာခြင်းဖြင့် ခေတ်အသီးသီး၌ ရေးသားခဲ့ကြ သည့် အက္ခရာပုံသဏ္ဌာန်တို့ကို သိနိုင်သည်။
''';
        break;
      case '4':
        name = 'မင်စာ';
        text =  '''ရှေးဂူဘုရားများတွင် အတွင်းဘက်အုတ်နံရံများ၌ မင်ဖြင့် ရေးထားသော စာများရှိတတ်သည်။ ဗုဒ္ဓဝင် ဇာတ်နိပါတ် ပန်းချီသရုပ်ဖော်ပုံများနှင့်ဆိုင်သည့် စာတန်းများ၊ မူလကုသိုလ်ရှင်၏ ဆုတောင်းစာများ၊ နောက်ထပ်ပြုပြင်မွမ်းမံသူတို့၏ ဖြည့်စွက်မှတ်တမ်းများ၊ ထိုခေတ်က မွေးဖွားသူတို့၏ ဇာတာခွင်များစသည်ကို မင်ဖြင့်ရေးခဲ့ ကြသဖြင့် ထိုစာတို့ကို မင်စာဟု ခေါ်သည်။ ပုဂံမြို့ လောကထိပ်ပန်ဂူဘုရားမှ ဇာတ်ကြီး ဆယ်ဘွဲ့ မင်စာများမှာ ထင်ရှားကျော်ကြားသည်။ သက္ကရာဇ်အခိုင်အမာပါသော မင်စာများ ရှိသကဲ့သို့ သက္ကရာဇ်မပါသော မင်စာများလည်း ရှိသည်။ ပင်းယ၊ အင်းဝ၊ တောင်ငူ၊ ညောင်ရမ်း၊ ကုန်းဘောင်ခေတ်တိုင်အောင် မင်စာများကို တွေ့ရသည်။ ကျောက်စာ များနည်းတူ ထိုမင်စာတို့မှာလည်း ခေတ်အဆက်ဆက် အက္ခရာပုံသတို့ကို လေ့လာနိုင်သည်။
''';
        break;
      case '5':
        name = 'ပေစာ ၊ ပုရပိုက်စာ';
        text =  '''ပေ၊ပုရပိုက်တို့ကို စာရေးကိရိယာအဖြစ် ပုဂံခေတ်ကပင် စတင် အသုံးပြုခဲ့ကြမည်ဟု ယုံကြည်ရသည်။ သို့သော် နှစ်ကာအလွန်ကြာညောင်းပြီးဖြစ်၍ ထိုခေတ်က ပေ၊ ပုရပိုက်တို့ကို တွေ့နိုင်ရန်မလွယ်ကူတော့ချေ။ အစောဆုံးအနေနှင့် မြန်မာသက္ကရာဇ် ၁၀ဝ၀-ခန့် (အေဒီ-၁၇-ရာစု)ကရေးခဲ့သည့် ပေများကိုမူ တွေ့နိုင်ပေသေး သည်။ ထို့ကြောင့် သက္ကရာဇ် ၁၀ဝ၀မှ ယနေ့ ၁၃၀ဝ-ကျော်အထိ၊ နှစ်ပေါင်း ၃၀ဝ-ကျော်အတွင်း ရေးသားခဲ့သည့် အက္ခရာတို့၏ ပုံသဏ္ဌာန်ကို ထိုပေ၊ ပုရပိုမ်များတွင်လည်း တွေ့နိုင်သည်။
''';
        break;
      case '6':
        name = 'ခေါင်းလောင်းစာ';
        text =  '''ခေတ်အဆက်ဆက် စေတီပုထိုးများတွင် သွန်းလုပ်လှူဒါန်းခဲ့ သော သတ္ထုခေါင်းလောင်းများ၌ ကုသိုလ်ရှင်၏ ကမ္ပည်းမှတ်တမ်းပါရှိတတ်သည်။ ယင်းစာများသည်လည်း မူလအရေးအသားများ ဖြစ်၍ အက္ခရာပုံလေ့လာရာ၌ အသုံးဝင် သည်။
''';
        break;
      case '7':
        name = 'ပုံနှိပ်စာ';
        text =  '''ပထမမြန်မာပုံနှိပ်စာအုပ်ကို သက္ကရာဇ် ၁၁၃၈-ခု (အေဒီ-၁၇၇၆)တွင် ရောမမြို့၌ ပုံနှိပ်ခဲ့သည်။ အောက်မြန်မာနိုင်ငံ ရန်ကုန်မြို့တွင် သက္ကရာဇ် ၁၁၇၉-ခု (အေဒီ-၁၈၁၇)၌ ပုံနှိပ်လုပ်ငန်းစတင်ပြီး အထက်မြန်မာနိုင်ငံ မန္တလေး ရတနာပုံမြို့တော်တွင်လည်း သက္ကရာဇ် ၁၂၂၆-ခု (အေဒီ-၁၈၆၄) ၌ စာပုံနှိပ်လုပ်ငန်း ပေါ်ပေါက်လာကာ ပုံနှိပ်စာများ ထွန်းကားလာသည်။
''';
        break;

    }
    return SafeArea(
      child: ListView(
        padding: const EdgeInsets.all(20.0),
        children: <Widget>[
          Container(
            child: Center(
              child: TextContainerTitle(name, 25.0),
            ),
          ),
          Padding(
            padding: EdgeInsets.all(5.0),
          ),
          Container(
            decoration: BoxDecoration(
              border: Border.all(color: Colors.grey),
            ),
            child: Column(
                children: <Widget>[
                  Padding(
                    padding: EdgeInsets.only(bottom: 16.0),
                  ),
                  Image.asset(
                    'images/$imageName.jpg',
                    width: 300.0,
                    height: 200.0,
                    fit: BoxFit.fill,
                  ),
                  Padding(
                    padding: EdgeInsets.only(bottom: 16.0),
                  ),
                  Container(
                    padding: const EdgeInsets.all(8.0),
                    child: Text(text,
                      style: TextStyle(
                        fontSize: 16.0,
                      ),
                      softWrap: true,
                    ),
                  ),
                ]
            ),
          ),

          Container(
            padding: EdgeInsets.only(bottom: 16.0),
          ),

        ],
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      length: 8,
      child: Scaffold(
        appBar: AppBar(
          bottom: TabBar(
            tabs: [
              Tab(
                child: Text('၀'),
              ),
              Tab(
                child: Text('၁'),
              ),
              Tab(
                child: Text('၂'),
              ),
              Tab(
                child: Text('၃'),
              ),
              Tab(
                child: Text('၄'),
              ),
              Tab(
                child: Text('၅'),
              ),
              Tab(
                child: Text('၆'),
              ),
              Tab(
                child: Text('၇'),
              ),
            ],
          ),
          title: Text('မူရင်းအရေးအသားများ'),
          backgroundColor: Colors.redAccent,
        ),
        body: TabBarView(
          children: [
            _makeTab('0', 'stone_mon_letters'),
            _makeTab('1', 'stone_mon_letters'),
            _makeTab('2', 'stone_mon_letters'),
            _makeTab('3', 'stone_mon_letters'),
            _makeTab('4', 'stone_mon_letters'),
            _makeTab('5', 'pay_letters'),
            _makeTab('6', 'stone_mon_letters'),
            _makeTab('7', 'stone_mon_letters'),
          ],
        ),
      ),
    );
  }
}
