import 'package:flutter/material.dart';
import 'package:myanmar_sar/text_style.dart';

class GrammarChapter1Page extends StatefulWidget {
  @override
  _GrammarChapter1PageState createState() => _GrammarChapter1PageState();
}

class _GrammarChapter1PageState extends State<GrammarChapter1Page> {

  Widget _makeTab(i){
    var name;
    var text;
    switch (i) {
      case '1':
        name = 'အက္ခရာများ';
        text = '''
        မြန်မာသင်ပုန်းကြီးတွင် ဗျည်းအက္ခရာ (၃၃) လုံး ရှိသည်။ ၎င်းတို့မှာ-
က ခ ဂ ဃ င	ဟူသော က၀ဂ်အက္ခရာ (၅) လုံး၊
စ ဆ ဇ ဈ ည ဟူသော စ၀ဂ်အက္ခရာ (၅) လုံး၊
ဋ ဌ ဍ ဎ ဏ ဟူသော ဋ၀ဂ်အက္ခရာ (၅) လုံး၊
တ ထ ဒ ဓ န ဟူသော တ၀ဂ်အက္ခရာ (၅) လုံး၊
ပ ဖ ဗ ဘ မ ဟူသော ပ၀ဂ်အက္ခရာ (၅) လုံး၊
ယ ရ လ ၀ သ ဟ ဠ အ ဟူသော အ၀ဂ် အက္ခရာ (၈) လုံး
တို့ ဖြစ်ကြသည်။ ၀ဂ်အက္ခရာ (၂၅) လုံးရှိ၍၊ အ၀ဂ်အက္ခရာ (၈)လုံး ရှိသည်။

      ပါဠိဘာသာရေးရိုးရေးစဉ်အတိုင်း ”က…ဠ” နောက်တွင် အ အက္ခရာထက်၌ နိဂ္ဂဟိတ်တင်သော (အံ) ကို ဖြည့်၍ က…ဠ၊ အံ ဟု ဗျည်း (၃၃) လုံး ရေတွက်သတ်မှတ်ကြသည်လည်း ရှိသည်။ ဤ၌ သေးသေးတင် (ံ) ကိုသာ ဗျည်းဟု ဆိုလိုသည်။ ယှဉ်သော (အ) မှာ အသံရွတ်ဆိုရရုံမျှ ပြထားခြင်းဖြစ်သည်။ [မှတ်ချက်။       ။ အချို့ပညာရှိများကလည်း (ံ) အပြင် ဝိသဇ္ဇနီ (း) ပါထည့်ပြီး ဗျည်း (၃၄) လုံးဟု သတ်မှတ်လိုသည်။  အချို့ကမူ က…ဠ၊ အံ၊ အံ့၊ အံး ဟူ၍လည်းကောင်း၊ အချို့က က…ဠ၊ အံ့၊ အံ၊ အံး ဟူ၍လည်းကောင်း ဗျည်း ၃၅-လုံး သတ်မှတ်လိုသည်။ (ံ) အပြင် အောင်မြစ် (့) နှင့် ဝိသဇ္ဇနီ (း) တို့ကို ဗျည်းအဖြစ် ဖြည့်စွက်ရေတွက် ဖော်ပြခြင်းဖြစ်သည်။]

      အ အဆုံး ဗျည်း (၃၃) လုံးမူသည် မြန်မာမှုအရ အရေးအသားစနစ်ကို အလေးပေးထား၍ အံ အဆုံး ဗျည်း (၃၃) လုံးမူမှာ စကားသံစနစ်ကို အလေးပေးထားကြောင်း တွေ့ရသည်။

      အံ (ံ) ဗျည်းအဆုံးထားလိုသူတို့က (အ) သည် သရမျှသာဖြစ်၍ ဗျည်းစာရင်းတွင် ပါစရာမလို၊ (ံ) သာ ဗျည်းအဖြစ် ပါသင့်သည်ဟု ယူဆကြသည်။ သို့သော် (အ) သည် ရှေးပုဂံခေတ်ကပင် သရ၏ တာ၀န်အပြင် ဗျည်းတစ်ခုသဖွယ် ဆောင်ရွက်လာခဲ့ကြောင်းကို ဤသို့ တွေ့ရပေသည်။
 
(က)     က အစ ဠ အဆုံး ဗျည်း (၃၂) လုံးကို သရသင်္ကေတများနှင့် ယှဉ်၍ အက္ခရာပွားနိုင်သကဲ့သို့ (အ) ကိုလည်း ယင်းသင်္ကေတအားလုံးနှင့် ယှဉ်၍ အက္ခရာပွားနိုင်သည်။
(ခ)       အခြား ဗျည်းများကို ၀ဆွဲ၍ ဗျည်းတွဲအဖြစ် ရေးနိုင်သကဲ့သို့ (အ) ကိုလည်း ၀ဆွဲ၍ ဗျည်းတွဲအဖြစ် ရေးနိုင်သည်။
[သာဓက။        ။ အွတ်]
(ဂ)       ဗျည်းတို့တွင် အသတ်တင်၍ ရေးနိုင်သကဲ့သို့ ပုဂံခေတ်က (အ) တွင် အသတ်တင်၍ ရေးခဲ့ကြသည်။
[သာဓက။        ။ ဖေိအ်၊ ပ္လေါအ်၊ တပေအ်။]
 
      ဤသည်တို့ကို ထောက်၍ ရှေးမြန်မာတို့သည် မြန်မာစကားသံများကို အက္ခရာဖြင့် ဖော်ပြရာ၌ အ အက္ခရာကို ဗျည်းတစ်ခုသဖွယ် တီထွင် သုံးစွဲခဲ့ကြသည်မှာ ထင်ရှားပေသည်။ ထို့ကြောင့် ဗျည်းအက္ခရာတို့ အရေးပွားပုံစနစ်ကိုပြသည့် သင်ပုန်းကြီး၌ ဗျည်းအက္ခရာ၏ လုပ်ငန်းများ အားလုံးကို ဆောင်ရွက်ပေးသော (အ) ကို ဗျည်းအက္ခရာများအဆုံး၌ တစ်ပေါင်းတည်း ထည့်သွင်းပြသထားခြင်းဖြစ်သည်။ ဤသို့ ပြခြင်းဖြင့် လက်တွေ့၌ အသုံးတည့်လှပေသည်။ ထို့ကြောင့် ပါဠိကျမ်းဂန်အရ က အစ အံ အဆုံး ဗျည်း (၃၃) လုံးကို သူ့နည်း သူ့ဟန် မှန်ကန်သည့် အလျောက် ရှိစေ၍ လက်တွေ့ သင်ကြားမှုနယ်ပယ်၌ အသုံးတည့်သော မြန်မာ့နည်း မြန်မာ့ဟန် က အစ အ အဆုံး ဗျည်း (၃၃) လုံးကို သင်ပုန်းကြီးမူအတိုင်း အစဉ်တစိုက် လက်ခံခဲ့ကြပေသည်။

      မြန်မာစာရေးသားရာတွင် အပိုဒ် (၂၇) ပါ ဗျည်း (၃၃) လုံးအပြင် ပါဠိစာပေတွင် သုံးသည့် ဉကလေးကိုလည်း အသုံးပြုလျက်ရှိသည်။ ပါဠိစာပေတွင် စ၀ဂ်၌ စ၊ ဆ၊ ဇ၊ ဈ၊ ဉ ဟု ဉကလေးနှင့်သာ ရှိသည်။ ညကြီးမှာ ပါဠိတွင် ဉကလေးနှစ်လုံးဆင့်သည့် ပါဌ်ဆင့်စာလုံး ဖြစ်သည်။ သို့သော် မြန်မာစာတွင် ပုဂံခေတ်ကစ၍ စ၀ဂ်ကို စ၊ ဆ၊ ဇ၊ ဈ၊ ည ဟု ညကြီးဖြင့် သတ်မှတ်ခဲ့ကြသည်။ ပုဂံ၊ ပင်းယနှင့် အင်း၀ ခေတ်ဦး ကျောက်စာများတွင် ပါဠိဂါထာရေးရာ၌ပင် ဉကလေးကို သုံးခဲလှသည်။ ညကြီးကိုသာ သုံးသည်။ မြန်မာစာခေတ်ဦးတွင် ညကြီးသာ အသုံးတွင်သည်။ (သာဓက။ ။ ပည္စ၀ဂ္ဂီ၊ ဗျည္ဇန၊ ညာဏ်။) သက္ကရာဇ် ၈၀၀ ခန့်ရောက်မှ ဉကလေးကို သုံးလာသည်။ သို့တိုင်အောင် ကုန်းဘောင်ခေတ် နန်းသုံးစာပေရေးရာ၌ ဉ ကလေးကို ‘ဉ ဦးခေါင်းမဲ့’ ဟူ၍ အသုံးမပြုရ။ ညကြီးကိုသာ သုံးရသည်။ (ဉ် ) ရေးလိုသော် (ည်)နှင့် ကွဲပြားအောင် (ညံ်) ဟု အစက်သင်္ကေတဖြင့် ရေးသည်။ ထို့ကြောင့် ဗျည်း (၃၃) လုံး ရေတွက်ရာတွင် ပုဂံခေတ်ကတည်းက မြန်မာတို့ တစ်သမတ်တည်း သုံးခဲ့သည့် ညကြီးကိုသာ ထည့်သွင်း ရေတွက်သည်။ ဉကလေးကို စ၀ဂ်အက္ခရာတစ်လုံးအဖြစ် ထည့်မည်ဆိုလျှင် စ၀ဂ်၌၊ စ၊ ဆ၊ ဇ၊ ဈ၊ ဉ၊ ည ဟု အက္ခရာ ၆ လုံး ရှိမည်ဖြစ်ရာ တစ်၀ဂ်လျှင် ၅ လုံးစီရှိသော အစဉ်အလာပျက်မည်ဖြစ်သည်။ စ၀ဂ်တွင် ညကြီးက နေရာယူပြီးဖြစ်၍ နောက်မှ အသုံးပြုလာသော ဉကလေးကို ဗျည်းအရေအတွက်တွင် မထည့်ကြတော့ပေ။
 
      ပုဂံခေတ် မြန်မာကျောက်စာအချို့၌ သက္ကတဗျည်း ၂ လုံးကိုလည်း တွေ့ရသည်။ ၎င်းဗျည်းတို့မှာ ‘ဂသျှ’ ခေါ် (ူ) နှင့် ‘ပသျှ’ ခေါ် (ြ) တို့ ဖြစ်သည်။
''';
        break;
      case '2':
        name = 'ဗျည်းတွဲများ';
        text = '''
        မြန်မာစာတွင် -ျ၊ ြ – ၊ -ွ၊ -ှ ဟူ၍ အခြေခံဗျည်းတွဲ သင်္ကေတ (၄) ခုရှိသည်။ ဗျည်းတွဲသင်္ကေတများသည် ကျ၊ ပြ၊ စွ၊ လှ စသည်ဖြင့် ဗျည်း (၃၃) လုံးမှ ဆီလျော်ရာ ဗျည်းများနှင့် ယှဉ်တွဲနိုင်သည်။ လျှ၊ ြွက၊ ြွမ စသည်ဖြင့် ဗျည်းတွဲသင်္ကေတအချင်းချင်း နှစ်ခု သုံးခုပေါင်း၍လည်း ဗျည်းများနှင့် ယှဉ်တွဲနိုင်သည်။

     နှစ်ခုပေါင်းသော ဗျည်းတွဲသင်္ကေတ (၅) တွဲမှာ အောက်ပါတို့ ဖြစ်သည်။
-ျ + -ွ = ကျွ
ြ- + -ွ = ကြွ
-ျ + -ှ = -ကျှ
ြ- + -ှ = ပြှ
-ွ + -ှ = -ွှ

     သုံးခုပေါင်းသော ဗျည်းတွဲသင်္ကေတ (၂) တွဲမှာ အောက်ပါတို့ ဖြစ်သည်-
-ျ + -ွ + -ှ =  ပျွှ
ြ – + -ွ + -ှ = ပြွှ
ဤသို့အားဖြင့် ဗျည်းတွဲသင်္ကေတ စုစုပေါင်း (၁၁) တွဲ ရှိသည်။

     အထက်ဖော်ပြပါ ဗျည်းတွဲသင်္ကေတများသည် ပုဂံခေတ် မြန်မာစာအရေးအသား ထွန်းကားစကတည်းက မြန်မာတို့ အသုံးပြုခဲ့ကြသော ဗျည်းတွဲသင်္ကေတများဖြစ်သည်။ ၎င်းတို့အပြင် ပုဂံခေတ်မှ အင်း၀ခေတ်တိုင် – ္လ (လဆွဲ) ဗျည်းတွဲသင်္ကေတရှိခဲ့သည်။ လဆွဲသည် က၀ဂ်ဗျည်း၊ ပ၀ဂ်ဗျည်းများနှင့် ယှဉ်သည်။ (သာဓက။  ။ က္လ၊ ခ္လပ်၊ ပ္လု၊ ဖ္လစ်။) သက္ကရာဇ် ၈၀၀ ကျော်သောအခါ က၀ဂ်ဗျည်းနှင့်ယှဉ်သော လဆွဲနေရာတွင် ယပင့်သည်လည်းကောင်း၊ ပ၀ဂ်ဗျည်းနှင့်ယှဉ်သော လဆွဲနေရာတွင် ရရစ်သည်လည်းကောင်း ၀င်ရောက်လာသည်။ [သာဓက။        ။ က္လ ြွ ကျ။ ပ ္လု ြွ ပြု။] ထိုသို့ ပြောင်းသွားခြင်းမှာ ယင်းစကားလုံးတို့၏ အသံထွက် ရွေ့လျောမှုကြောင့် ဖြစ်ရာသည်။

     လဆွဲ ဗျည်းတွဲသင်္ကေတနှင့်သော် ထိုရှေးခေတ်က အခြေခံ ဗျည်းတွဲသင်္ကေတ (၅) ခု ရှိခဲ့သည်။ နှစ်ခုပေါင်းသော ဗျည်းတွဲသင်္ကေတများလည်း ယခုထက် အရေအတွက်ပိုသည်။ ပုဂံခေတ်မှ အင်း၀ခေတ်တိုင် အောက်ပါနှစ်ခုပေါင်း ဗျည်းတွဲသင်္ကေတများကို သုံးခဲ့ကြသည်။
-ျ + ြ-  = ြ- ျ (သာဓက။   ။ တြ ျာ၊ ဆြိ ျာ)
-ျ + – ္လ =  -္လ ျ (သာဓက။    ။ ခ္လျင်၊ က္လျပ်)
-္လ + -ွ = -လွ (သာဓက။         ။ ကလွတ်၊ ခလွတ်)
– ္လ + – ှ = -လှ (သာဓက။       ။ မ္လှူ)
ထို့ကြောင့် အင်း၀ခေတ် သက္ကရာဇ် ၈၀၀ ကျော်အထိ ဗျည်းတွဲသင်္ကေတ (၁၆) ခု သုံးခဲ့သည်။ သက္ကရာဇ် ၈၀၀ ကျော် ‘လ’ သံ တိမ်ကောသွားသည့် အခါ ဗျည်းတွဲသင်္ကေတ (၁၁) ခု တည်တံ့လာသည်။
''';
        break;
      case '3':
        name = 'အသတ်ဗျည်းများ';
        text = '''
        မြန်မာအသတ် ဗျည်း (၁၀) ခု ရှိသည်။ ၎င်းတို့မှာ အောက်ပါတို့ဖြစ်သည်-
က၀ဂ် – က်၊ င်
စ၀ဂ် – စ်၊ ဉ် ၊ ည်
တ၀ဂ် – တ်၊ န်
ပ၀ဂ် – ပ်၊ မ်
အ၀ဂ် – ယ်။

      ၀ဏ္ဏဗောဓနသတ်အင်းတွင် က်၊ င်၊ စ်၊ ည်၊ တ်၊ န်၊ ပ်၊ မ် ဟူ၍ အသတ်ဗျည်း (၈) ခု ပြသည်။ ေ၀ါဟာရတ္ထပကာသနီကျမ်းက အဆိုပါ (၈) ခုတွင် ယ် နှင့် ၀် ဖြည့်၍ (၁၀) ခု ပြဆိုခဲ့သည်။ မြန်မာသင်ပုန်းကြီးတွင်လည်း က်၊ င်၊ စ်၊ ည်၊ တ်၊ န်၊ ပ်၊ မ်၊ ယ်၊ ၀် ဟူ၍ အသတ်ဗျည်း (၁၀) ခု ပြသည်။

      မြန်မာအသတ် ဗျည်းတို့၏ သမိုင်းတွင် ၀သတ်သည် အေဒီ ၁၉ ရာစုအတွင်း၌ ခေတ်တိမ်သွားသည်။ ဉ သတ်ကို အေဒီ ၁၅ ရာစု အလယ် (သက္ကရာဇ် ၈၀၀ ခန့်)တွင် အသုံးပြုလာကြသည်။ ထို့နောက် ‘ဉ ဦးခေါင်းမဲ့’ ဟူသော အမည်ကြောင့် မင်္ဂလာမရှိဟု ပစ်ပယ်ခံခဲ့ရသည်။ ဉသတ်သည် အေဒီ ၁၉ ရာစု ကုန်ခါနီးတွင်မှ တည်တံ့လာသည်။
  
      ဤသမိုင်းကြောင်းအရ အသုံးမတွင်တော့သော ၀် ကို ချန်လှပ်၍ အသုံးတွင်သော ဉ် ကို ထည့်သွင်းကာ အသတ်ဗျည်း (၁၀) ခု ရေတွက်သည်။
   
      မြန်မာစာအရေးအသား ခေတ်ဦးကာလကမူ က်၊ င်၊ စ်၊ ည်၊ တ်၊ န်၊ ပ်၊ မ်၊ ယ်၊ ၀်၊ ဟ်၊ အ် ဟူ၍ အသတ်ဗျည်း (၁၂) ခုအထိ ရှိခဲ့ဖူးသည်။
    
      ထိုစဉ်က ဟ် ကို ယခု ၀စ္စပေါက်သုံးသည့်နေရာတွင် သုံးကြသည်။ (သာဓက။      ။ သာဟ် = သား၊ ဖျက်ဆီဟ် = ဖျက်ဆီး။) ဟ် သည် အေဒီ ၁၃ ရာစုအစတွင် ပျောက်ကွယ်သွားခဲ့သည်။ ၀စ္စပေါက်မှာ အေဒီ ၁၆ ရာစုရောက်မှ အသုံးတွင်ကျယ်လာသည်။
  
      အ် ကို မြန်မာစာအရေးအသား စတင်တွေ့ရချိန်မှ အေဒီ ၁၆ ရာစုအထိ တွေ့ရသည်။ အသတ်မပါသော သံရှည်စာလုံးများ ဖြစ်သည့် ပေ၊ ဧ စသည်တို့ကို အသံတိုစေရန် ‘အ’ သတ်၍ ပေအ်၊ ဧအ် ဟု ရေးသည်။ ပေ့၊ အေ့ ဟု အောက်မြစ်သံထွက်သည်။ အသတ်ပါသော သံရှည် စာလုံးများဖြစ်သည့် နှင်၊ အမ်၊ နိယ် စသည်တို့ကို အသံတိုစေလိုသောအခါတွင်မူ နှင်အ်၊ အမ်အ်၊ နိယ်အ် ဟု အသတ်ဗျည်းနှစ်ခု ဆက်မရေးတော့ဘဲ ထက်အောက်ဆင့်လျက် နှင်အ ၊ အမ်အ ၊ နိယ်အ  ဟု နေရာချုံ့၍ ရေးခဲ့ကြသည်။ နှင့်၊ အံ့၊ နေ့ဟု အောက်မြစ်သံထွက်သည်။ ဤသို့ဖြင့် အ် နှင့် အ် ချုံ့ရေးသည့်  -အ် ဟူ၍ ရှိခဲ့သည်။ အ် သည် အေဒီ ၁၆ ရာစု (သက္ကရာဇ် ၉၀၀ ခန့်)တွင် တိမ်ကောပျောက်ကွယ်သွားသည်။ -အ် မှာ မျက်မြင်ပုံသဏ္ဌာန်အရ အဆွဲသဘောသို့ သက်ရောက်သွားပြီး အောက်မြစ်သို့ အဆင့်ဆင့် ပြောင်းလဲသွားသည်။   
''';
        break;
      case '4':
        name = 'ပါဠိ';
        text = '''
          မြန်မာတို့သည် ပါဠိဘာသာ၊ သက္ကတဘာသာနှင့် ထိတွေ့ခဲ့သည်မှစ၍ မြန်မာဘာသာ၌ လိုအပ်သော ဝေါဟာရများကို ပါဠိဘာသာ သက္ကတဘာသာတို့မှ ရတန်သရွေ့ ယူငင်သုံးစွဲခဲ့ကြသည်။ ဤသို့သုံးစွဲရာ၌ မူလအသွင်သဏ္ဌာန်မပျက် ယူငင် သုံးစွဲသည်လည်း ရှိသည်။
[သာဓက။     ။ ဒါန၊ သီလ၊ အနိစ္စ၊ ဒုက္ခ၊  အနတ္တ စသည်။] မြန်မာ့အာ၊ မြန်မာ့နားနှင့် အဆင်ပြေအောင် လိုအပ်သလို ပြုပြင်၍ သုံးစွဲသည်လည်း ရှိသည်။ [သာဓက။     ။ စိတ္တ ြွ စိတ်၊ ဓာတု ြွ ဓာတ်၊ စရိတ ြွ စရိုက်၊ မန္တြ ြွ မန္တန်] ပါဠိ၊ သက္ကတေ၀ါဟာရများကို မြန်မာမှုပြုရာ၌ နောက်ဆုံးစာလုံးကို ချေခြင်း (မဂ္ဂ = မဂ်ဂမှ နောက်ဆုံး ဂ ကို ချေခြင်း) ၊ နောက်ဆုံးစာလုံး၏ သရကို ချေခြင်း (ဓာတုတွင် တုမှ ဥ သရကို ချေခြင်း) စသည်တို့ဖြင့် မဂ်၊ ဓာတ် ကဲ့သို့ အသတ်ဗျည်းအဆုံး ရှိသော ပါဠိ၊ သက္ကတသက်စာလုံးများ ဖြစ်လာသည်။ ဤသို့ဖြင့် မြန်မာဘာသာ၌ မြန်မာအသတ်ဗျည်း (၁၀) ခု အပြင် ပါဠိ၊ သက္ကတသက် အသတ်ဗျည်းများ ပေါ်ပေါက်ခဲ့သည်။ မြန်မာတို့ ပါဠိ၊ သက္ကတသက် အသတ်ဗျည်းများကို သုံးစွဲလာခဲ့သည်မှာ ပုဂံခေတ် ကျောက်စာများ ပေါ်ပေါက်သည့် အေဒီ ၁၁ ရာစုမှ ယနေ့တိုင်ပင် ဖြစ်သည်။ ပါဠိ၊ သက္ကတေ၀ါဟာရများကို မြန်မာမှုပြု၍ မြန်မာဆန်ဆန် သတ်သည်ကို သဒ္ဒါနုသာရီသတ်နည်းဟု စာပေ ကျမ်းဂန်များတွင် တွေ့ရသည်။ ၀ဏ္ဏဗောဓနသတ်အင်းတွင် ရှင်ဥက္ကံသမာလာက ”မာဂဓသို့လိုက်၍ သတ်သည့်အသတ်” ဟု ခေါ်ဆိုသည်။ ပါဠိ၊ သက္ကတသက် အသတ် ေ၀ါဟာရများကို စုစည်း၍ မုံကင်း ဆရာတော် ရှင်ဝိသုဒ္ဓ ပြုစုထားသည့် ‘သဒ္ဒါနုသာရီ သတ်ပုံကျမ်း’ (၁၂၁၅-ခု) နှင့် တောင်ငူမြို့ စာရေး ဦးကြီး၏ ‘ပါဌာနုသာရီ သတ်ပုံကျမ်း’ (၁၂၂၁-ခု)တို့ ပေါ်ပေါက်ခဲ့ဖူးသည်။

 ပါဠိ၊ သက္ကတသက် အသတ်ဗျည်း (၂၇) လုံး တွေ့ရှိရသည်။ ၀ဏ္ဏဗောဓနသတ်အင်းတွင် (၂၂) လုံး ပြ၍ လယ်တီဆရာတော်၏ သင်ပုန်းကြီး သံခိပ်တွင် (၂၅) လုံး ပြသည်။ ယင်း (၂၇) လုံးအနက် ၀ဏ္ဏဗောဓနသတ်အင်းတွင် ခ၊ ဉ ၊ ဌ ၊ ထ၊ ဓ၊ ဘ (၆) လုံး မပါ။ ဍ ပါသည်။ သင်ပုန်းကြီးသံခိပ်၌ စ၊ ဌ၊ ပ (၃) လုံး မပါ။ ဃ ပါသည်။ သက်ဆိုင်ရာ အသတ်ဗျည်းများ၊ သာဓကစာလုံးများ၊ ၎င်းတို့၏ မူရင်းပါဠိ၊ သက္ကတစာလုံးများကို အောက်တွင် ဖော်ပြထားသည်။
အသတ်
သာဓက
မူရင်းပါဠိ၊ သက္ကတ (သ)
က်
စက်၊ ဝိပါက်၊ ကရဝိက်၊ သုက်၊ ဧက်၊ စရိုက်	စက္က၊ ဝိပါက၊ ကရဝိက၊ သုက္က၊ ဧက၊ စရိတ
ခ်
မုခ်	မုခ
ဂ်
၀ဂ်၊ ယုဂ်	၀ဂ္ဂ၊ ယုဂ
င်
မဟာ၀င်၊ လိင်၊ နိသီဒိုင်၊ မဏ္ဍိုင်	မဟာဝံသ၊ လိင်္ဂ၊ နိသီဒန၊ မဏ္ဍလ
စ်
နစ်၊ နိစ်၊ ဝုစ်	နစ္စ၊ နီစ၊ ၀စန
ဇ်
ဧကရာဇ်၊ ပရဗိုဇ်	ဧကရာဇာ၊ ပရိဗ္ဗာဇတ
ဉ်
သံယောဇဉ်၊ ယာဉ်၊ သေဉ်၊ သုဉ်း၊ ဝိညာဉ်	သံယောဇန၊ ယာန၊ သေယ၊ သုည၊ ဝိညာဏ
ည်
ဥဒည်၊ နည်း၊ ဗျည်း	ဥဒယ၊ နယ၊ ဗျဉ္ဇန
ဋ်
ဝဋ်၊ ဂိဇ္ဈကုဋ်၊ မကိုဋ်	၀ဋ္ဋ၊ ဂိဇ္ဈကူဋ၊ မကုဋ
ဌ်
ဥက္ကဌ်၁ ၊ ပါဌ်	ဥက္ကဌ၊  ပါဌ
ဏ်
ဒဏ်၊ ဉာဏ်၊ ပကိဏ်း၊ ဂုဏ်၊ လိုဏ်	ဒဏ္ဍ၊ ဉာဏ၊ ပကိဏ္ဏက၊ ဂုဏ၊ လေဏ
တ်
နတ်၊ နိပါတ်၊ စိတ်၊ မုတ်၊ ခေတ်	နာထ၊ နိပါတ၊ စိတ္တ၊ မုတ္တ၊ ခေတ္တ
ထ်
ဣရိယာပုထ်၂	ဣရိယာပထ
ဒ်
လဒ်၊ ပါဒ်၊ ပုဒ်၊ ပိုဒ်	လဒ္ဓ၊ ပါဒ၊ ပဒ၊ ပဒ
ဓ်
ပဋိသိဓ်၊ ဝဇီရာဝုဓ်	ပဋိသေဓ၊ ဝဇီရာဝုဓ
န်
ကန်၊ မာန်၊ မိန်၊ မဟာဝုန်၊ ဖန်၊ သိန်	ကနျာ (သ)၊ မာန၊ မီန၊ မဟာဝန၊ ဖလိက၊ သိရီ
ပ်
ကပ်၊ ကလာပ်၊ သံခိပ်၊ ရုပ်	ကပ္ပ၊ ကလာပ၊ သခေင်္ပ၊ ရူပ
ဗ်
ဒြဗ်၃	ဒြဝျ (သ)
ဘ်
လာဘ်	လာဘ
မ်
နာမ်၊ သိမ်	နာမ၊ သီမာ
ယ်
အသူရကာယ်	အသုရကာယ
ရ်
မာရ်၊ ထေရ်၊ ပဟိုရ်	မာရ၊ ထေရ၊ ပဟာရ
လ်
ဗိုလ်	ဗလ
ဝ်
သိဉ္ဇိုဝ်း၄၊ မဂ္ဃဇိုဝ်း၄	သဉ္ဇီဝ၊ မဃဒေဝ
သ်
ဇောတိရသ်၊ ဉာသ်၊ ဥပုသ်	ဇောတိရသ၊ ဉာသ၊ ဥပေါသထ
ဟ်
သိဟ်၊ သင်္ဂြိုဟ်	သီဟ၊ သဂြင်္ဟ (သ)
ဠ်
ပြုဗ္ဗာသာဠ်၊ သီဟိုဠ်	ပူဝါၑါဎ(သ)၊ သီဟဠ
[မှတ်ချက်။       ၁။        ဥက္ကဋ္ဌ၊ အဋ္ဌစသည် ဋ် + ဌ အဆုံးရှိသည့်စာလုံးများကို မြန်မာမှုပြု ရာတွင် စနစ်အရ နောက်ဆုံးဗျည်း ဌ ကို ချေသော် ဋ် ကျန်ရမည်ဖြစ်သော်လည်း ဋ် ကို ချေပြီး ဌ် ဖြင့် ဥက္ကဌ်၊ အဌ် ဟုသာ ရေးရိုးအစဉ်အလာရှိသည်။

      ပါဠိ ဣရိယာပထမှ ဆင်းသက်လာသော ဣရိယာပုတ်ကို ရှေးယခင်က ထ် ဖြင့် ရေးခဲ့ကြသည်။ ယခု မြန်မာဆန်ဆန် တ် ဖြင့်ပင် ရေးကြသည်။
   
      သက္ကတဒြဝျမှ ဆင်းသက်လာသည့် ဒြပ်ကို ယခင်က ဒြဗ် ဟု ဗသတ်ဖြင့် ရေးခဲ့ကြသည်။ ယခု မြန်မာဆန်ဆန် ပ် ဖြင့်ပင် ရေးကြသည်။
   
     ပါဠိ သဉ္ဇီဝ၊ မဃဒေဝ တို့မှ ဆင်းသက်သည့် သိဉ္ဇိုး၊ မဂ္ဃဇိုး တို့ကို ယခင်က သိဉ္ဇိုဝ်း၊ မဂ္ဃဇိုဝ်းဟု ဝ် ဖြင့် ရေးခဲ့ကြသည်။ ဝ် ကို မြန်မာအသတ်တစ်ခုအဖြစ် မသုံးတော့သည့် အခါတွင် ပါဠိသက် ဝသတ်များကိုလည်း စွန့်ပယ်ခဲ့ကြသည်။]
    
      အထက်ပါ အသတ် (၂၇) ခု အပြင် ယခင်က ဃ် ကိုလည်း ပါဠိသက် အသတ်အဖြစ် ယူဆရေတွက်ကြသည်ကို တွေ့ရသည်။ မိုး ဟူသော စာလုံးကို ခေတ်အဆက်ဆက် ရှေးဟောင်း ကျောက်စာ၊ မင်စာများတွင် မိုဝ် ဟူ၍ ရေးခဲ့ကြသည်။ သို့သော် အေဒီ ၁၉ ရာစု ခန့်တွင် ပါဠိမေဃမှ မိုး ဖြစ်သည်ဟူသော အယူအဆ လွှမ်းမိုးလာပြီး ‘မိုဃ်း’ဟု ရေးခဲ့ကြသည်။ အေဒီ ၂ဝ ရာစုအလယ် ရောက်သောအခါ ရှေးကျောက်စာ၊ မင်စာများကို အထောက်အထားပြု၍ ဃ် ကို ဖြုတ်ခဲ့ကြသည်။
''';
        break;
    }
    return SafeArea(
      child: ListView(
        padding: const EdgeInsets.all(20.0),
        children: <Widget>[
          Container(
            child: Center(
              child: TextContainerTitle(name, 25.0),
            ),
          ),
          Padding(
            padding: EdgeInsets.all(5.0),
          ),
          Container(
            decoration: BoxDecoration(
              border: Border.all(color: Colors.grey),
            ),
            child: Column(
                children: <Widget>[
                  Padding(
                    padding: EdgeInsets.only(bottom: 16.0),
                  ),
                  Padding(
                    padding: EdgeInsets.only(bottom: 16.0),
                  ),
                  Container(
                    padding: const EdgeInsets.all(8.0),
                    child: Text(text,
                      style: TextStyle(
                        fontSize: 16.0,
                      ),
                      softWrap: true,
                    ),
                  ),
                ]
            ),
          ),

          Container(
            padding: EdgeInsets.only(bottom: 16.0),
          ),

        ],
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      length: 4,
      child: Scaffold(
        appBar: AppBar(
          bottom: TabBar(
            tabs: [
              Tab(
                child: Text('အက္ခရာများ'),
              ),
              Tab(
                child: Text('ဗျည်းတွဲ'),
              ),
              Tab(
                child: Text('အသတ်ဗျည်း'),
              ),
              Tab(
                child: Text('ပါဠိ'),
              ),
            ],
          ),
          title: Text('မြန်မာ့ အက္ခရာများ'),
          backgroundColor: Colors.redAccent,
        ),
        body: TabBarView(
          children: [
            _makeTab('1'),
            _makeTab('2'),
            _makeTab('3'),
            _makeTab('4'),
          ],
        ),
      ),
    );
  }
}
